IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CMPSSA8_CONTROLSS_CMPSSA8.xml
<module name="CONTROLSS_CMPSSA8_CONTROLSS_CMPSSA8" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_CMPSSA8_COMPCTL" acronym="CONTROLSS_CMPSSA8_COMPCTL" offset="0x0" width="16" description="">
		<bitfield id="COMPDACE" width="1" begin="15" end="15" resetval="0x0" description="Comparator/DAC enable.    0  Comparator/DAC disabled   1  Comparator/DAC enabled" range="15" rwaccess="RW"/> 
		<bitfield id="ASYNCLEN" width="1" begin="14" end="14" resetval="0x0" description="Low comparator asynchronous path enable. Allows asynchronous comparator output to feed into OR gate with latched digital filter signal when CTRIPLSEL=3 or CTRIPOUTLSEL=3.    0  Asynchronous comparator output does not feed into OR gate with latched digital filter output   1  Asynchronous comparator output feeds into OR gate with latched digital filter output" range="14" rwaccess="RW"/> 
		<bitfield id="CTRIPOUTLSEL" width="2" begin="13" end="12" resetval="0x0" description="Low comparator CTRIPOUTL source select.    0  Asynchronous comparator output drives CTRIPOUTL   1  Synchronous comparator output drives CTRIPOUTL   2  Output of digital filter drives CTRIPOUTL   3  Latched output of digital filter drives CTRIPOUTL" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="CTRIPLSEL" width="2" begin="11" end="10" resetval="0x0" description="Low comparator CTRIPL source select.    0  Asynchronous comparator output drives CTRIPL   1  Synchronous comparator output drives CTRIPL   2  Output of digital filter drives CTRIPL   3  Latched output of digital filter drives CTRIPL" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="COMPLINV" width="1" begin="9" end="9" resetval="0x0" description="Low comparator output invert.    0  Output of comparator is not inverted   1  Output of comparator is inverted" range="9" rwaccess="RW"/> 
		<bitfield id="COMPLSOURCE" width="1" begin="8" end="8" resetval="0x0" description="CompL Pos Mux Select0 positive mux selects INL_3p3v voltage (default)1 postive mux selects INH_3p3v" range="8" rwaccess="RW"/> 
		<bitfield id="ASYNCHEN" width="1" begin="6" end="6" resetval="0x0" description="High comparator asynchronous path enable. Allows asynchronous comparator output to feed into OR gate with latched digital filter signal when CTRIPHSEL=3 or CTRIPOUTHSEL=3.    0  Asynchronous comparator output does not feed into OR gate with latched digital filter output   1  Asynchronous comparator output feeds into OR gate with latched digital filter output" range="6" rwaccess="RW"/> 
		<bitfield id="CTRIPOUTHSEL" width="2" begin="5" end="4" resetval="0x0" description="High comparator CTRIPOUTH source select.    0  Asynchronous comparator output drives CTRIPOUTH   1  Synchronous comparator output drives CTRIPOUTH   2  Output of digital filter drives CTRIPOUTH   3  Latched output of digital filter drives CTRIPOUTH" range="5 - 4" rwaccess="RW"/> 
		<bitfield id="CTRIPHSEL" width="2" begin="3" end="2" resetval="0x0" description="High comparator CTRIPH source select.    0  Asynchronous comparator output drives CTRIPH   1  Synchronous comparator output drives CTRIPH   2  Output of digital filter drives CTRIPH   3  Latched output of digital filter drives CTRIPH" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="COMPHINV" width="1" begin="1" end="1" resetval="0x0" description="High comparator output invert.    0  Output of comparator is not inverted   1  Output of comparator is inverted" range="1" rwaccess="RW"/> 
		<bitfield id="COMPHSOURCE" width="1" begin="0" end="0" resetval="0x0" description="CompH neg Mux slect0 negative mux selects DAC voltage (default)1 negative mux selects INL_3p3v" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_COMPHYSCTL" acronym="CONTROLSS_CMPSSA8_COMPHYSCTL" offset="0x2" width="16" description="">
		<bitfield id="COMPHYS" width="4" begin="3" end="0" resetval="0x0" description="Comparator hysteresis. Sets the amount of hysteresis on the comparator inputs.    0  None   1  Set to typical hysteresis   2  Set to 2x of typical hysteresis   3  Set to 3x of typical hysteresis   4  Set to 4x of typical hysteresis others : undefined" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_COMPSTS" acronym="CONTROLSS_CMPSSA8_COMPSTS" offset="0x4" width="16" description="">
		<bitfield id="COMPLLATCH" width="1" begin="9" end="9" resetval="0x0" description="Latched value of low comparator digital filter output" range="9" rwaccess="RO"/> 
		<bitfield id="COMPLSTS" width="1" begin="8" end="8" resetval="0x0" description="Low comparator digital filter output" range="8" rwaccess="RO"/> 
		<bitfield id="COMPHLATCH" width="1" begin="1" end="1" resetval="0x0" description="Latched value of high comparator digital filter output" range="1" rwaccess="RO"/> 
		<bitfield id="COMPHSTS" width="1" begin="0" end="0" resetval="0x0" description="High comparator digital filter output" range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_COMPSTSCLR" acronym="CONTROLSS_CMPSSA8_COMPSTSCLR" offset="0x6" width="16" description="">
		<bitfield id="LSYNCCLREN" width="1" begin="10" end="10" resetval="0x0" description="Low comparator latch EPWMSYNCPER clear. Enable EPWMSYNCPER reset of low comparator digital filter output latch COMPSTS[COMPLLATCH].    0  EPWMSYNCPER will not reset latch   1  EPWMSYNCPER will reset latch" range="10" rwaccess="RW"/> 
		<bitfield id="LLATCHCLR" width="1" begin="9" end="9" resetval="0x0" description="Low comparator latch software clear. Perform software reset of low comparator digital filter output latch COMPSTS[COMPLLATCH].  Reads always return 0.    0  No effect   1  Generate a single pulse of latch reset signal for COMPSTS[COMPLLATCH]" range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HSYNCCLREN" width="1" begin="2" end="2" resetval="0x0" description="High comparator latch EPWMSYNCPER clear. Enable EPWMSYNCPER reset of high comparator digital filter output latch COMPSTS[COMPHLATCH].    0  EPWMSYNCPER will not reset latch   1  EPWMSYNCPER will reset latch" range="2" rwaccess="RW"/> 
		<bitfield id="HLATCHCLR" width="1" begin="1" end="1" resetval="0x0" description="High comparator latch software clear. Perform software reset of high comparator digital filter output latch COMPSTS[COMPHLATCH].  Reads always return 0.    0  No effect   1  Generate a single pulse of latch reset signal for COMPSTS[COMPHLATCH]" range="1" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_COMPDACCTL" acronym="CONTROLSS_CMPSSA8_COMPDACCTL" offset="0x8" width="16" description="">
		<bitfield id="FREESOFT" width="2" begin="15" end="14" resetval="0x0" description="Free-run or software-run emulation behavior. Behavior of the ramp generator during emulation suspend.    00b  Ramp generator stops immediately during emulation suspend   01b  Ramp generator completes current ramp and stops at next EPWMSYNCPER during emulation suspend   1Xb  Ramp generator runs freely" range="15 - 14" rwaccess="RW"/> 
		<bitfield id="BLANKEN" width="1" begin="12" end="12" resetval="0x0" description="EPWMBLANK enable. This bit enables the EPWMBLANK signal.    0  EPWMBLANK signal is disabled.   1  EPWMBLANK signal is enabled." range="12" rwaccess="RW"/> 
		<bitfield id="BLANKSOURCE" width="4" begin="11" end="8" resetval="0x0" description="EPWMBLANK source select. This bit field determines which EPWMnBLANK is passed on as the EPWMBLANK signal.  Where n represents the maximum number of EPWMBLANK signals available on the device:    0  EPWM1BLANK   1  EPWM2BLANK   2  EPWM3BLANK   ...   n-1  EPWMnBLANK" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="SWLOADSEL" width="1" begin="7" end="7" resetval="0x0" description="Software load select. Determines whether DACxVALA is updated from DACxVALS on SYSCLK or EPWMSYNCPER.    0  DACxVALA is updated from DACxVALS on SYSCLK   1  DACxVALA is updated from DACxVALS on EPWMSYNCPER" range="7" rwaccess="RW"/> 
		<bitfield id="RAMPLOADSEL" width="1" begin="6" end="6" resetval="0x0" description="Ramp load select. Determines whether RAMPSTS is updated from RAMPMAXREFA or RAMPMAXREFS when COMPSTS[COMPHSTS] is triggered.    0  RAMPSTS is loaded from RAMPMAXREFA   1  RAMPSTS is loaded from RAMPMAXREFS" range="6" rwaccess="RW"/> 
		<bitfield id="SELREF" width="1" begin="5" end="5" resetval="0x0" description="CMPSS reference select0 vref_1p8v as reference voltage (default)1 vdd_1p8v as reference voltage" range="5" rwaccess="RW"/> 
		<bitfield id="RAMPSOURCE" width="4" begin="4" end="1" resetval="0x0" description="EPWMSYNCPER source select. Determines which EPWMnSYNCPER signal is used within the CMPSS module.  Where n represents the maximum number of EPWMSYNCPER signals available on the device:      0  EPWM1SYNCPER     1  EPWM2SYNCPER     2  EPWM3SYNCPER   ...   n-1  EPWMnSYNCPER" range="4 - 1" rwaccess="RW"/> 
		<bitfield id="DACSOURCE" width="1" begin="0" end="0" resetval="0x0" description="DAC source select. Determines whether DACHVALA is updated from DACHVALS or from the ramp generator.    0  DACHVALA is updated from DACHVALS   1  DACHVALA is updated from the ramp generator" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_COMPDACCTL2" acronym="CONTROLSS_CMPSSA8_COMPDACCTL2" offset="0xA" width="16" description="">
		<bitfield id="RAMPSOURCEUSEL" width="1" begin="10" end="10" resetval="0x0" description="0: Selects EPWM0 to 15 as RAMP source 1: Selects EPWM16 to 31 as RAMP source" range="10" rwaccess="RW"/> 
		<bitfield id="BLANKSOURCEUSEL" width="1" begin="8" end="8" resetval="0x0" description="0: Selects EPWM0 to 15 as blank source 1: Selects EPWM16 to 31 as blank source" range="8" rwaccess="RW"/> 
		<bitfield id="DEACTIVESEL" width="5" begin="5" end="1" resetval="0x0" description="DEACTIVE source select: 0x0 : EPWM1.DEACTIVE   0x1 : EPWM2.DEACTIVE  0x2 : EPWM3.DEACTIVE  0x3 : EPWM4.DEACTIVE  . . 0x31 :  EPWM32.DEACTIVE" range="5 - 1" rwaccess="RW"/> 
		<bitfield id="DEENABLE" width="1" begin="0" end="0" resetval="0x0" description="DE mode enable.    0  DE mode features disabled.   1  DE mode features enabled." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_DACHVALS" acronym="CONTROLSS_CMPSSA8_DACHVALS" offset="0xC" width="16" description="">
		<bitfield id="DACVAL" width="12" begin="11" end="0" resetval="0x0" description="High DAC shadow value. When COMPDACCTL[DACSOURCE]=0, the value of DACHVALS is loaded into DACHVALA on the trigger signal selected by COMPDACCTL[SWLOADSEL]." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_DACHVALA" acronym="CONTROLSS_CMPSSA8_DACHVALA" offset="0xE" width="16" description="">
		<bitfield id="DACVAL" width="12" begin="11" end="0" resetval="0x0" description="High DAC active value. Value that is actively driven by the high DAC." range="11 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_RAMPMAXREFA" acronym="CONTROLSS_CMPSSA8_RAMPMAXREFA" offset="0x10" width="16" description="">
		<bitfield id="RAMPMAXREF" width="16" begin="15" end="0" resetval="0x0" description="Ramp maximum reference active value. Latched value to be loaded into ramp generator RAMPSTS." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_RAMPMAXREFS" acronym="CONTROLSS_CMPSSA8_RAMPMAXREFS" offset="0x14" width="16" description="">
		<bitfield id="RAMPMAXREF" width="16" begin="15" end="0" resetval="0x0" description="Ramp maximum reference shadow. Unlatched value to be loaded into ramp generator RAMPSTS." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_RAMPDECVALA" acronym="CONTROLSS_CMPSSA8_RAMPDECVALA" offset="0x18" width="16" description="">
		<bitfield id="RAMPDECVAL" width="16" begin="15" end="0" resetval="0x0" description="Ramp decrement value active. Latched value that will be subtracted from RAMPSTS." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_RAMPDECVALS" acronym="CONTROLSS_CMPSSA8_RAMPDECVALS" offset="0x1C" width="16" description="">
		<bitfield id="RAMPDECVAL" width="16" begin="15" end="0" resetval="0x0" description="Ramp decrement value shadow. Unlatched value to be loaded into RAMPDECVALA." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_RAMPSTS" acronym="CONTROLSS_CMPSSA8_RAMPSTS" offset="0x20" width="16" description="">
		<bitfield id="RAMPVALUE" width="16" begin="15" end="0" resetval="0x0" description="Ramp value. Present value of ramp generator." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_DACLVALS" acronym="CONTROLSS_CMPSSA8_DACLVALS" offset="0x24" width="16" description="">
		<bitfield id="DACVAL" width="12" begin="11" end="0" resetval="0x0" description="Low DAC shadow value. value to be loaded into DACLVALA on the trigger signal selected by COMPDACCTL[SWLOADSEL]." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_DACLVALA" acronym="CONTROLSS_CMPSSA8_DACLVALA" offset="0x26" width="16" description="">
		<bitfield id="DACVAL" width="12" begin="11" end="0" resetval="0x0" description="Low DAC active value. Value that is actively driven by the low DAC." range="11 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_RAMPDLYA" acronym="CONTROLSS_CMPSSA8_RAMPDLYA" offset="0x28" width="16" description="">
		<bitfield id="DELAY" width="13" begin="12" end="0" resetval="0x0" description="Ramp delay active value. Latched value of the number of cycles to delay the start of the ramp generator decrementer after a EPWMSYNCPER is received." range="12 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_RAMPDLYS" acronym="CONTROLSS_CMPSSA8_RAMPDLYS" offset="0x2A" width="16" description="">
		<bitfield id="DELAY" width="13" begin="12" end="0" resetval="0x0" description="Ramp delay shadow value. Unlatched value to be loaded into RAMPDLYA." range="12 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_CTRIPLFILCTL" acronym="CONTROLSS_CMPSSA8_CTRIPLFILCTL" offset="0x2C" width="16" description="">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="Low filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="Low filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state. Threshold used is THRESH+1." range="13 - 9" rwaccess="RW"/> 
		<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="Low filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8 - 4" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_CTRIPLFILCLKCTL" acronym="CONTROLSS_CMPSSA8_CTRIPLFILCLKCTL" offset="0x2E" width="16" description="">
		<bitfield id="CLKPRESCALE" width="16" begin="15" end="0" resetval="0x0" description="Low filter sample clock prescale. Number of system clocks between samples is CLKPRESCALE+1." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_CTRIPHFILCTL" acronym="CONTROLSS_CMPSSA8_CTRIPHFILCTL" offset="0x30" width="16" description="">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="High filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="High filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state. Threshold used is THRESH+1." range="13 - 9" rwaccess="RW"/> 
		<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="High filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8 - 4" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_CTRIPHFILCLKCTL" acronym="CONTROLSS_CMPSSA8_CTRIPHFILCLKCTL" offset="0x32" width="16" description="">
		<bitfield id="CLKPRESCALE" width="16" begin="15" end="0" resetval="0x0" description="High filter sample clock prescale. Number of system clocks between samples is CLKPRESCALE+1." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_COMPLOCK" acronym="CONTROLSS_CMPSSA8_COMPLOCK" offset="0x34" width="16" description="">
		<bitfield id="TEST" width="1" begin="4" end="4" resetval="0x0" description="TEST Lock. This bit, when set, will prevent any further writes to the any undocumented registers that may affect the performance/behavior of this block. Once set this bit can only be cleared by a reset." range="4" rwaccess="RW
	  			 SONCE"/> 
		<bitfield id="CTRIP" width="1" begin="3" end="3" resetval="0x0" description="Lock write-access to the CTRIPxFILTCTL and CTRIPxFILCLKCTL registers.    0  CTRIPxFILCTL and CTRIPxFILCLKCTL registers are not locked. Write 0 to this bit has no effect.   1  CTRIPxFILCTL and CTRIPxFILCLKCTL registers are locked. Only a system reset can clear this bit." range="3" rwaccess="RW
	  			 SONCE"/> 
		<bitfield id="DACCTL" width="1" begin="2" end="2" resetval="0x0" description="Lock write-access to the DACCTL register.    0  DACCTL register is not locked. Write 0 to this bit has no effect.   1  DACCTL register is locked. Only a system reset can clear this bit." range="2" rwaccess="RW
	  			 SONCE"/> 
		<bitfield id="COMPHYSCTL" width="1" begin="1" end="1" resetval="0x0" description="Lock write-access to the COMPHYSCTL register.    0  COMPHYSCTL register is not locked. Write 0 to this bit has no effect.   1  COMPHYSCTL register is locked. Only a system reset can clear this bit." range="1" rwaccess="RW
	  			 SONCE"/> 
		<bitfield id="COMPCTL" width="1" begin="0" end="0" resetval="0x0" description="Lock write-access to the COMPCTL register.    0  COMPCTL register is not locked. Write 0 to this bit has no effect.   1  COMPCTL register is locked. Only a system reset can clear this bit." range="0" rwaccess="RW
	  			 SONCE"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_DACHVALS2" acronym="CONTROLSS_CMPSSA8_DACHVALS2" offset="0x38" width="16" description="">
		<bitfield id="DACVAL" width="12" begin="11" end="0" resetval="0x0" description="High DAC shadow register2 value. When COMPDACCTL[DACSOURCE]=0, the value of DACHVALS2 is loaded into DACHVALA when DE mode is enabled and selected DEACTIVE input is asserted." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_DACLVALS2" acronym="CONTROLSS_CMPSSA8_DACLVALS2" offset="0x3A" width="16" description="">
		<bitfield id="DACVAL" width="12" begin="11" end="0" resetval="0x0" description="Low DAC shadow register2 value.  Value of DACHVALS2 is loaded into DACHVALA when DE mode is enabled and selected DEACTIVE input is asserted." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CMPSSA8_CONFIG1" acronym="CONTROLSS_CMPSSA8_CONFIG1" offset="0x3C" width="16" description="">
		<bitfield id="SPARE" width="8" begin="15" end="8" resetval="0x0" description="SPARE" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="COMPLHYS" width="4" begin="7" end="4" resetval="0x0" description="compL Hysterisishystl_1p1v[3] = reservedhystl_1p1v[2] = control which comparator output value the hysteresis is applied tohystl_1p1v[1:0] = hysteresis value00  0 LSB01  17.5 LSB10  35 LSB11  52.5 LSB" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="COMPHHYS" width="4" begin="3" end="0" resetval="0x0" description="CompH Hysteresishysth_1p1v[3] = reservedhysth_1p1v[2] 0 comparator hysteresis is applied when the comparator output is 1'b11 comparator hysteresis is applied when the comparator output is 1'b0hysth_1p1v[1:0] = hysteresis value00  0 LSB01  17.5 LSB10  35 LSB11  52.5 LSB" range="3 - 0" rwaccess="RW"/>
	</register>
</module>